Autodesk.Revit.UI.ISnappingServer.FindSnaps(Autodesk.Revit.UI.SnappingServiceData)
Finds snaps to the nearest point and to planes perpendicular to the work plane.

Autodesk.Revit.UI.ISnappingServer
An interface that all servers of SnappingService implement.